<template>
    <div>
        <swiper class="swiper" :options="swiperOption">
            <swiper-slide class="text">
                <div>
                    很多人说，女司机面对孩子所以才敢动手，如果是个纹身金链子大汉肯定不敢，所以她欺软怕硬。这种逻辑属于偷换概念，把“挡路和打人”的问题替换成女司机的人品问题，继而占领道德高地。警察面前有初中生抢劫也会制止，但是换成脸上有刀疤的疯子杀人犯，他也不敢。那么警察是不是欺软怕硬、人品败坏呢？ps：这是我家乡的真实新闻，两个警察吓得躲在桌子下面，局长亲自出面公关。成年人做事都会计算收益和代价，如果代价远高于收益就不会去做，这与人品无关。何况，就算有关，也与本问题的核心冲突无关。
                    作者：妖伊社
                    链接：https://www.zhihu.com/question/325857271/answer/694521263
                    来源：知乎
                    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
                    很多人说，女司机面对孩子所以才敢动手，如果是个纹身金链子大汉肯定不敢，所以她欺软怕硬。这种逻辑属于偷换概念，把“挡路和打人”的问题替换成女司机的人品问题，继而占领道德高地。警察面前有初中生抢劫也会制止，但是换成脸上有刀疤的疯子杀人犯，他也不敢。那么警察是不是欺软怕硬、人品败坏呢？ps：这是我家乡的真实新闻，两个警察吓得躲在桌子下面，局长亲自出面公关。成年人做事都会计算收益和代价，如果代价远高于收益就不会去做，这与人品无关。何况，就算有关，也与本问题的核心冲突无关。

                    作者：妖伊社
                    链接：https://www.zhihu.com/question/325857271/answer/694521263
                    来源：知乎
                    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
                    很多人说，女司机面对孩子所以才敢动手，如果是个纹身金链子大汉肯定不敢，所以她欺软怕硬。这种逻辑属于偷换概念，把“挡路和打人”的问题替换成女司机的人品问题，继而占领道德高地。警察面前有初中生抢劫也会制止，但是换成脸上有刀疤的疯子杀人犯，他也不敢。那么警察是不是欺软怕硬、人品败坏呢？ps：这是我家乡的真实新闻，两个警察吓得躲在桌子下面，局长亲自出面公关。成年人做事都会计算收益和代价，如果代价远高于收益就不会去做，这与人品无关。何况，就算有关，也与本问题的核心冲突无关。

                    作者：妖伊社
                    链接：https://www.zhihu.com/question/325857271/answer/694521263
                    来源：知乎
                    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
                    很多人说，女司机面对孩子所以才敢动手，如果是个纹身金链子大汉肯定不敢，所以她欺软怕硬。这种逻辑属于偷换概念，把“挡路和打人”的问题替换成女司机的人品问题，继而占领道德高地。警察面前有初中生抢劫也会制止，但是换成脸上有刀疤的疯子杀人犯，他也不敢。那么警察是不是欺软怕硬、人品败坏呢？ps：这是我家乡的真实新闻，两个警察吓得躲在桌子下面，局长亲自出面公关。成年人做事都会计算收益和代价，如果代价远高于收益就不会去做，这与人品无关。何况，就算有关，也与本问题的核心冲突无关。

                    作者：妖伊社
                    链接：https://www.zhihu.com/question/325857271/answer/694521263
                    来源：知乎
                    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
                    很多人说，女司机面对孩子所以才敢动手，如果是个纹身金链子大汉肯定不敢，所以她欺软怕硬。这种逻辑属于偷换概念，把“挡路和打人”的问题替换成女司机的人品问题，继而占领道德高地。警察面前有初中生抢劫也会制止，但是换成脸上有刀疤的疯子杀人犯，他也不敢。那么警察是不是欺软怕硬、人品败坏呢？ps：这是我家乡的真实新闻，两个警察吓得躲在桌子下面，局长亲自出面公关。成年人做事都会计算收益和代价，如果代价远高于收益就不会去做，这与人品无关。何况，就算有关，也与本问题的核心冲突无关。

                    作者：妖伊社
                    链接：https://www.zhihu.com/question/325857271/answer/694521263
                    来源：知乎
                    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
                </div>
            </swiper-slide>
        </swiper>
    </div>
</template>

<script>
import {swiper, swiperSlide} from 'vue-awesome-swiper'
import 'swiper/dist/css/swiper.css'
export default {
    data (){
        return {
            swiperOption: {
                direction: 'vertical',
                slidesPerView: 'auto',
                freeMode: true,
                mousewheel: true
            }
        }
    },
    components: {
        swiper,
        swiperSlide
    }
}
</script>

<style scoped>
.swiper{
    height:300px;
    overflow: hidden;
}
.swiper .text{
    font-size: 18px;
    text-align: center;
    padding: 30px;
    height: auto;
    -webkit-box-sizing: border-box;
    box-sizing: border-box;
}
</style>